In [1]:
import pandas as pd
import numpy as np
import names

In [2]:
names = [names.get_first_name() for i in range(10)]

names

['Dorothy',
 'Deborah',
 'Susan',
 'Keith',
 'Inez',
 'Donna',
 'Virginia',
 'Joseph',
 'Shirley',
 'Joyce']

In [3]:
Eng = [np.random.randint(30,100) for i in range(10)]

In [4]:
Maths = [np.random.randint(30,100) for i in range(10)]

In [5]:
Physics = [np.random.randint(30,100) for i in range (10)]

In [6]:
df = pd.DataFrame({"Eng":Eng, "Maths": Maths, "Physics": Physics}, index = names)

In [7]:
df["Total"] = df["Eng"] + df["Maths"] + df["Physics"]

df["Average"] = round(df["Total"]/3,2)

In [8]:
df

          Eng  Maths  Physics  Total  Average
Dorothy    55     78       31    164    54.67
Deborah    94     51       47    192    64.00
Susan      65     65       98    228    76.00
Keith      51     68       93    212    70.67
Inez       37     98       68    203    67.67
Donna      72     92       57    221    73.67
Virginia   45     43       40    128    42.67
Joseph     51     52       53    156    52.00
Shirley    68     45       31    144    48.00
Joyce      65     40       32    137    45.67

# Boolean Indexing

In [9]:
# I want total marks of students < 200

df["Total"] < 200

Dorothy      True
Deborah      True
Susan       False
Keith       False
Inez        False
Donna       False
Virginia     True
Joseph       True
Shirley      True
Joyce        True
Name: Total, dtype: bool

In [10]:
# Now, I want all details of students instead of boolean values

df[ df["Total"]<200 ]

          Eng  Maths  Physics  Total  Average
Dorothy    55     78       31    164    54.67
Deborah    94     51       47    192    64.00
Virginia   45     43       40    128    42.67
Joseph     51     52       53    156    52.00
Shirley    68     45       31    144    48.00
Joyce      65     40       32    137    45.67

In [11]:
# Now, I want only total column marks instead of boolean values

df[ df["Total"]<200 ]  ["Total"]

Dorothy     164
Deborah     192
Virginia    128
Joseph      156
Shirley     144
Joyce       137
Name: Total, dtype: int64

In [12]:
# Now, I want only total & Average column instead of boolean values

df[ df["Total"]<200 ]  [ ["Total","Average"] ]

          Total  Average
Dorothy     164    54.67
Deborah     192    64.00
Virginia    128    42.67
Joseph      156    52.00
Shirley     144    48.00
Joyce       137    45.67